[
    {
        "url": "https://www.bostonglobe.com/2025/03/14/business/beacon-hill-parking-spot-750000-boston/",
        "raw_pub_date": "2025-03-14",
        "pub_date": "2025-03-14T00:00:00",
        "hed": "Parking spot on Beacon Hill listed for an eye-popping $750,000",
        "subhead": "",
        "content": "The stately brick homes on Beacon Hill aren’t the only real estate that’s selling for a premium fee.A single parking spot in a garage on Brimmer Street is on the market for $750,000, according to a real estate listing posted last week. It’s just the latest spot to notch a steep price tag in the neighborhood, where it seems the only thing more coveted than housing is parking.“It’s a great long-term hold,” said Rene Rodriguez, a realtor for Cabot & Company and one of the spot’s two listing agents. “They’re not going to be building any more parking on the hill.”The parking space, first reported on by the Boston Herald, is located in a luxury garage just off Storrow Drive that offers refueling, car washing, and other concierge services, according to the listing.AdvertisementRodriguez said the spot belongs to a family that recently closed a deal to sell their home in the neighborhood. Some potential buyers have shown interest in the space, but it was still “very much available” as of Thursday, he added.Brimmer Street Garage, which bills itself as Beacon Hill’s “most exclusive venue to capture a parking space,” operates as a condominium; the spots are sold privately as deeded, taxable pieces of property.When homes are sold on Beacon Hill, the sellers usually include the value of their parking spaces in the overall sale price. Oftentimes, the deeds to the spaces are transferred by a symbolic payment, Rodriguez said.“When [sellers] go to record the sale of the house, they also record the sale of the parking because it’s a fully separate deed, and they’ll just record it as $1,” he said. “So we actually don’t know what the true value was ... for that parking space.”But when parking spaces come on the market separately, they can fetch well over half a million dollars.“The owners of this space thought it made more sense to bring it to market and see what the market would bear,” Rodriguez said.In 1979, single parking spaces at the Brimmer were being sold for $7,500, or roughly $35,000 in today’s money, according to the garage’s website.AdvertisementLast year, the most expensive parking spot in the garage sold for $565,000, Rodriguez said.It’s rare for a parking space at a “full service” garage like the Brimmer to come on the market, he said.“If you’re spending $5 million, $10 million, $20 million for a house on the Hill and you don’t have any parking — at that point, for purchasing a spot, it becomes splitting hairs whether you pay $500,000 or $600,[000] or $700,000,” he said.Camilo Fonseca can be reached at camilo.fonseca@globe.com. Follow him on X @fonseca_esq and on Instagram @camilo_fonseca.reports.",
        "Outlet": "Boston Globe",
        "classifications": {
            "Residential Real Estate": 0.8953617811203003,
            "Real Estate Market Trends": 0.678309977054596,
            "Real Estate Investment": 0.6671785712242126,
            "Real Estate Legal": 0.5571603178977966,
            "Real Estate Finance": 0.3923489451408386,
            "Real Estate Technology": 0.3912678360939026,
            "Commercial Real Estate": 0.2533690631389618
        }
    },
    {
        "url": "https://www.bostonglobe.com/2025/03/14/business/boston-office-tower-sale-federal-street/",
        "raw_pub_date": "2025-03-14",
        "pub_date": "2025-03-14T00:00:00",
        "hed": "Another downtown Boston office tower is hitting the market",
        "subhead": "75-101 Federal St. is heading to the sale block as its mortgage comes due",
        "content": "In the latest test for Boston’s beleaguered office market, Rockpoint Group is preparing to put the two interconnected offices at 75-101 Federal St. in downtown Boston on the market in partnership with Wells Fargo, and is tapping brokerage Newmark to market the buildings for sale in the coming weeks, The Boston Globe has learned.Three real estate industry sources who spoke on condition of anonymity confirmed the pending listing. Rockpoint and Wells Fargo both declined to comment, while a representative for Newmark did not respond.The complex spans about 853,000 square feet and is about 71 percent occupied, according to data from real estate firm CoStar Group.Related: One of Boston’s skyline-defining towers is on the auction block — and expected to sell at a big discountThe pending sale comes amid a broad price reset for Boston’s office market, with a growing roster of towers going up for sale for the first time since the COVID-19 pandemic shook up demand for office space. Real estate experts expect downtown properties could be worth between 40 percent and 60 percent less than they were prior to the COVID-19 pandemic, and several recent sales bear out that thesis.Rockpoint Group has owned 75-101 Federal, at least in part, since 2015, when it purchased the conjoined offices for $326.5 million. Rockpoint sold a 50 percent stake in the buildings to Carr Properties in March 2020 — the very same week COVID was declared a national emergency — for about $185 more per square foot than it had paid five years previously. (Carr sold its stake back to Rockpoint last year for an undisclosed price). Also that week, Rockpoint and Carr finalized a $292 million mortgage with Wells Fargo, according to Suffolk County records, a mortgage with a maturity date of March 12, 2025.AdvertisementThe 75-101 Federal St. buildings have entrances on both Federal and Devonshire streets in downtown Boston. Here, one of the towers is reflected in the facade of 100 Federal St. David L. Ryan/Globe StaffThe brick and stone 75 Federal St. building dates to 1929 and was once described by the Boston Landmarks Commission as “the most elaborately decorative Art Deco skyscraper standing in Boston.” The 31-story tower at 101 Federal St. was built as an adjoining office in 1988. The towers are connected by a block-long lobby linking their two entrances — one on Federal Street, the other on Devonshire Street — that was renovated in 2016.AdvertisementTwo real estate industry sources said Rockpoint and Wells Fargo are working closely on the sale and collectively decided to bring Newmark’s capital markets team in to market the property. The 262,000-square-foot 75 Federal St. is 78 percent occupied, while the 591,000-square-foot 101 Federal St. is 64 percent occupied, according to CoStar.Related: Take a look at the first skyscraper proposed in downtown Boston since the pandemicIt’s not clear for how much the towers could sell. Several recent deals have seen properties trade at big discounts, with significant implications for both the city’s tax base and their owners’ balance sheets.For example, after purchasing 179 Lincoln St. near South Station in January 2020 for $155.7 million, a Blackstone entity sold the five-story building to Boston’s Synergy Investments last March for $76.5 million — a 51 percent price decline, according to research from Avison Young. Also last March, Synergy purchased 101 Arch St. in Downtown Crossing for $78 million — some 36 percent less than it sold for in 2005, and some $11 million less than the property had sold for in 2002.Catherine Carlock can be reached at catherine.carlock@globe.com. Follow her @bycathcarlock.",
        "Outlet": "Boston Globe",
        "classifications": {
            "Real Estate Market Trends": 0.9466114640235901,
            "Real Estate Investment": 0.9290624856948853,
            "Commercial Real Estate": 0.8684377670288086,
            "Residential Real Estate": 0.8201419115066528,
            "Real Estate Finance": 0.6181514859199524,
            "Real Estate Technology": 0.4874180853366852,
            "Real Estate Legal": 0.43727031350135803
        }
    },
    {
        "url": "https://www.bostonglobe.com/2025/03/10/business/mattapan-apartment-complex-affordable/",
        "raw_pub_date": "2025-03-10",
        "pub_date": "2025-03-10T00:00:00",
        "hed": "With $10 million in city aid, Mattapan apartment complex will stay at affordable rents",
        "subhead": "For years, Fairlawn has been at the center of a fight over displacement in Mattapan",
        "content": "For the last six years, Annie Gordon has not gone a day without worrying about facing eviction or a huge rent increase.Now, she can relax.Developer Related Beal, with financial backing from the City of Boston, is buying the 347-unit Mattapan apartment complex where Gordon has lived for nearly 50 years and setting rents at affordable rates, putting an end to a lengthy saga that saw fixed-income tenants battle with a landlord that bought the property in 2018 and raised rents dramatically.“The feeling is overwhelming relief,” said Gordon, who is 74. “When I got the call with the news, I couldn’t even believe it because we’ve been fighting, trying to stay in our homes for so long. There’s still a part of me that can’t believe it. We fought so hard, and we actually won.”AdvertisementSome tenants wept when they heard the news, Gordon said.“The toll this took on all of us,” she said, “was huge.”The city is contributing more than $10 million to the purchase to guarantee affordable rents for all of the units, as well as protections against big rent increases, officials said at a press conference at Fairlawn Estates, as the property was known before it was purchased in 2018. Half of the units will be set at rents affordable to tenants making 60 percent of the area median income, or $78,360 for a household of two, and the other half will be set at 80 percent AMI. Related’s deal with the city also caps annual rent increases at 2 percent a year.Related’s affiliate, Related Affordable, would not say how much they are spending to purchase the 12-building property, but DSF Group paid $65 million to buy it in 2018.Boston’s $10 million contribution is coming through its Acquisition Opportunity Program, which provides funding to community and housing groups to finance the purchase of market-rate housing to be maintained as permanently affordable. The groups behind the transactions can borrow against the city’s contribution to obtain additional capital. In this case, the city said it was able to secure nine times its $10 million investment in private funds.At 347 units, Related’s purchase of the Mattapan property is by far the largest such acquisition under the AOP. In 2022, the city helped finance the purchase of 36 small apartment buildings totaling 114 apartments in East Boston for affordable housing.Related: Leader of Mattapan tenant organization staves off eviction ... for nowAdvertisementThe program is part of a broader strategy by Mayor Michelle Wu that has seen the city pour hundreds of millions of pandemic recovery dollars into the construction and acquisition of affordable housing. By purchasing market-rate homes, the city can avoid the prohibitive costs it takes to build new affordable housing, while maintaining buildings in neighborhoods that are gentrifying rapidly.“The City of Boston is so proud to play a role in restoring Fairlawn as an affordable home, because for decades, these units were known that way: an affordable place to raise a family,” Wu said Monday. “Over the last few years especially, the rent here was hiked up ... and families were forced out of Fairlawn, out of Mattapan, and out of the city.”Now, “it’s a new day,” said city housing chief Sheila Dillon.Fairlawn was built in the 1960s off Mattapan’s Bismarck Street, and it eventually became a community cornerstone because its cheap rents supported a community of longtime tenants, some of whom live on fixed incomes.Annie Gordon in her Mattapan apartment in June 2020.Pat Greenhouse/Globe StaffA few of those tenants spent years advocating for the addition of the Mattapan commuter rail stop, but when it was finally built, the apartment complex became attractive for prospective investors, Gordon said.That’s when DSF bought the place. Rents immediately rose, in some cases, by hundreds of dollars. Many tenants couldn’t afford the increases. Some left, but others stayed and fought, refusing to pay the increases and forming a tenant association with the help of tenant group City Life/Vida Urbana.Related: From 2022: In East Boston, a big move to keep renters in their homesAdvertisementLast year, DSF moved to evict Gordon, but a judge sided with her and let her stay.“Tenants have been traumatized by this,” said Gabrielle Rene, the Mattapan community organizer for City Life. “This has been years of pain and struggle.”The saga at Fairlawn Estates highlights how vulnerable many residents of the city are to big rent increases, and why policy makers should prioritize protections for renters, said Gordon. People like Gordon would benefit directly from something like rent control, she said. And the city should also pass the Tenant Opportunity to Purchase Act, which would require landlords to give tenants and housing groups the opportunity to purchase apartment buildings before they go up for sale on the private market, she said.Related’s purchase is a rare victory for tenants in a city where apartment buildings change hands and rents soar frequently. Many of those sales have much different endings.“We’re grateful,” said Gordon. “I’m grateful I get to stay in my home.”Residents and advocates gave a round of applause during the announcement Monday. They have long protested the current owner of the Fairlawn apartments.David L. Ryan/Globe StaffAndrew Brinker can be reached at andrew.brinker@globe.com. Follow him @andrewnbrinker.",
        "Outlet": "Boston Globe",
        "classifications": {
            "Real Estate Investment": 0.9610015153884888,
            "Residential Real Estate": 0.9544281959533691,
            "Real Estate Legal": 0.9502890110015869,
            "Real Estate Finance": 0.9468461871147156,
            "Real Estate Market Trends": 0.8941465020179749,
            "Real Estate Technology": 0.8819913268089294,
            "Commercial Real Estate": 0.8423447012901306
        }
    },
    {
        "url": "https://www.bostonglobe.com/2025/02/28/business/middleborough-lawsuit-state-housing-law/",
        "raw_pub_date": "2025-02-28",
        "pub_date": "2025-02-28T00:00:00",
        "hed": "Middleborough sues Healey, state over MBTA housing law requirements",
        "subhead": "",
        "content": "The town of Middleborough sued Governor Maura Healey and the state housing office Friday, seeking an exemption from the controversial MBTA Communities Act, which requires cities and towns served by the T to make it easier to build multifamily housing within their borders.The lawsuit asks for a waiver from the law’s zoning requirements under a recent opinion from State Auditor Diana DiZoglio, who called the law an “unfunded mandate” because, she said, the Legislature did not designate adequate funds for its implementation.Related: More controversy erupts after state auditor says Mass. housing law is an ‘unfunded mandate’Middleborough, the town said in the lawsuit, has already built housing near its commuter rail station in recent years, and should not be forced to make room for more. Adhering to the law’s requirements would be a “significant expense” because the town does not have the infrastructure to accommodate more development, it said. Lawyers for the town added that the state has gone too far in punishing towns it deems noncompliant, carrying out a “campaign of threats, intimidation, and coercion.”Middleborough, a town of 24,000 about 30 miles south of Boston, has been at odds with the state over MBTA Communities for years. Its Select Board in 2022 voted to ignore the law’s requirements, making it the first town to take an official stand against the law. Last year, Town Meeting there overwhelmingly voted down a plan to comply, and the Select Board again decided this year against submitting an action plan for compliance under an extended state deadline.AdvertisementThe town wrote to DiZoglio’s office last year requesting her to weigh in on the law, and when Middleborough officials received her opinion last week calling it an unfunded mandate, they moved quickly to prepare a lawsuit.For the Healey administration, this is yet another roadblock for a law that it inherited from the Legislature but has become central to its housing strategy.The administration set a goal in February of building 222,000 new homes by 2035 in order to head off the housing shortage, which is quickly warping the economic reality of everyday residents. The state is well behind the pace of construction needed to meet that goal, and officials see MBTA Communities — Massachusetts’ most consequential new housing law in decades — as key to course correcting. Most of the state’s housing production over the last several decades has happened in Boston and a few neighboring communities. The law is designed to stimulate housing production in the suburbs and towns in Eastern Massachusetts that have long shut out new development.Related: 222,000 new homes must be built over the next decade to fix housing shortage, state saysAdvertisementBut towns have not taken kindly to the law. Some see it as an affront on Massachusetts' tradition of local government decisions over land-use rules, and many do not want to encourage the production of more homes, particularly apartment buildings.The law requires 177 cities and towns with access to the T create zoning districts that allow for multifamily housing, but it does not mandate building.Attorney General Andrea Campbell sued the town of Milton last year for failing to meet the law’s requirements, and the Supreme Judicial Court upheld the law, though it also ruled that the state must put the guidelines that shape its implementation through a formal regulatory process.Campbell, in a statement Friday, said her office will defend the law.“I am grateful to the majority of communities that understand the importance of responsible zoning, and my office and I intend to successfully defend this law in court,” Campbell said. “It is regrettable that the Auditor’s incorrect legal assessment has spurred challenges to a law meant to address our housing crisis.”Middleborough officials say the town created a multifamily zoning district in 2021 that has since yielded 174 multifamily units, a quarter of which are set at affordable rents. And over the last 20 years, the town has seen 881 housing units built within a mile of its commuter rail station.Related: How will the state’s historic rezoning mandate affect your community?AdvertisementIt argues that should be enough to satisfy the requirements of MBTA Communities. But under the law, the town has to create zoning that makes room for at least 1,471 units. The zoning the town passed in 2021 only allows for 549 units.Lawyers for the town said it has been unfairly punished for not complying with the law’s requirements “through the withholding and/or recission of more than $6.5 million in funding for school programs, infrastructure projects, and other initiatives that are necessary to provide the very housing the Act was enacted to create.” Those funding programs are discretionary, and the state has, in some cases, tied towns’ chances of approval to their MBTA Communities compliance status.“This isn’t something new in Middleboro. We recognize the need for more housing near public transit as a function of responsible town planning,” Middleborough Town Manager James McGrail said Friday. “We’ve done our part. We are not anti-housing. The fact that we’re even having to go to court to sort this out is crazy.”Andrew Brinker can be reached at andrew.brinker@globe.com. Follow him @andrewnbrinker.",
        "Outlet": "Boston Globe",
        "classifications": {
            "Real Estate Market Trends": 0.9528656005859375,
            "Real Estate Investment": 0.9327605962753296,
            "Real Estate Legal": 0.9303863048553467,
            "Real Estate Finance": 0.9073853492736816,
            "Residential Real Estate": 0.8983381986618042,
            "Commercial Real Estate": 0.8246079087257385,
            "Real Estate Technology": 0.7992646098136902
        }
    },
    {
        "url": "https://www.bostonglobe.com/2025/03/13/business/south-boston-public-housing-mccormack-redevelopment/",
        "raw_pub_date": "2025-03-13",
        "pub_date": "2025-03-13T00:00:00",
        "hed": "Huge South Boston public housing complex gets $70 million to start redevelopment",
        "subhead": "The project kicks off a two-decade-long overhaul of one of Boston’s biggest public housing projects",
        "content": "Developers working with the Boston Housing Authority have obtained $70 million in backing for the first phase of a long-planned redevelopment of South Boston’s Mary Ellen McCormack public housing complex, one of the oldest public housing projects in America.WinnCompanies and the BHA on Thursday said the financing would allow construction of a 112,000-square-foot building with 94 new apartments designated for low-income families who already live at the complex. Under a plan approved in 2023, Winn and the authority plan to raise $2 billion over the next two decades to redevelop the entire 30-acre complex into a mixed-income, mixed-use property with 3,300 apartments, retail space, and a community center.The first phase, dubbed Building A, will also include a new Veterans Park with an accessible tot lot, bike lane, new trees, and reconfigured streets safer for pedestrians.Advertisement“For almost nine decades, Mary Ellen McCormack has been a cornerstone of Boston’s commitment to affordable housing,” Boston Mayor Michelle Wu said in a statement. “Today, we take a major step forward in ensuring that this historic community remains a vibrant, inclusive home for generations to come.”Tenants have been involved in planning the entire project, according to Carol Sullivan, executive director of the Mary Ellen McCormack Task Force, a resident advocacy group. “I am very proud of this partnership and cannot wait to see the smiles on the residents’ faces when they move into their new, affordable homes,” Sullivan said in a statement.An artist's rendering of the first building in the planned redevelopment of South Boston's Mary Ellen McCormack public housing complex.The Architectural TeamWinnCompanies chief executive Gilbert Winn said the redevelopment project would be a model for similar projects across the country. “This first building jumpstarts an ambitious and inspired undertaking many years in the making that will ultimately give rise to a new mixed-income and mixed-use neighborhood,” Winn said in a statement.Ed Flynn, who represents the McCormack area on the City Council, said the redevelopment’s new park and community center will offer improvements to benefit all South Boston residents. “I couldn’t be more excited to see it through to completion in 2026,” Flynn said in an email.The project’s financing, $62 million for the building and $8 million for infrastructure, came from a variety of sources including a construction loan from Bank of America, federal Low Income Housing Tax Credit and Energy Tax Credit equity from Bank of America, a tax-exempt bridge loan and tax-exempt first mortgage loan from MassHousing, and a subordinate loan from the Affordable Housing Trust Fund maintained by the Massachusetts Executive Office of Housing & Livable Communities.AdvertisementThe McCormack project, built during the Great Depression, currently includes 1,016 deeply subsidized apartments across 35 buildings. All current residents will have the right to occupy new apartments as the project proceeds.Aaron Pressman can be reached at aaron.pressman@globe.com. Follow him @ampressman.",
        "Outlet": "Boston Globe",
        "classifications": {
            "Residential Real Estate": 0.4817359745502472,
            "Real Estate Investment": 0.30907073616981506,
            "Commercial Real Estate": 0.1871749609708786,
            "Real Estate Market Trends": 0.1859298050403595,
            "Real Estate Technology": 0.18022096157073975,
            "Real Estate Finance": 0.16105984151363373,
            "Real Estate Legal": 0.1322067677974701
        }
    },
    {
        "url": "https://www.bostonglobe.com/2025/03/11/business/boston-office-tower-auction/",
        "raw_pub_date": "2025-03-11",
        "pub_date": "2025-03-11T00:00:00",
        "hed": "One of Boston’s skyline-defining towers is on the auction block — and expected to sell at a big discount",
        "subhead": "Five years after COVID upended the city’s office market, a long-delayed reckoning on the value of office towers is coming",
        "content": "When Fortis Property Group announced a $1 billion refinancing of One Lincoln St. in 2022, the developers championed the deal as a milestone for downtown Boston’s revitalization.Fortis had landed a deal to lease 11 floors of the 36-story office building to private equity company HarbourVest and promised a heap of amenities — rooftop tennis and basketball courts, an artisanal market, and biergarten — to draw more tenants to fill the rest of the half-empty tower. Those plans attracted sophisticated investors, including San Francisco-based DivcoWest and Singaporean sovereign wealth fund GIC, according to a real estate industry source with knowledge of the deal.“This is an important moment for our firm and all of our partners,” said Joel Kestenbaum, president of Brooklyn-based Fortis, at the time. “And we couldn’t be prouder to see this deal come to fruition after nearly a year in the making.”Next week, the 503-foot tower will go up for auction — a move forced by one of Fortis’s unpaid lenders.AdvertisementIt’s a stunning turn of events for a building whose blue glass and gray granite facade has long been one of the most prominent points on Boston’s skyline. For two decades, it was home to State Street Corp., until 2023, when the financial giant decamped for a new tower across town.One Lincoln never recovered, and today — despite HarbourVest’s arrival — the building still stands about half empty. There are at least four big loans on the tower, and with little rent coming in, Fortis has struggled to pay down its substantial debt. Now lenders want the money back. In the auction process, a new owner will likely take over the building.The facade at One Lincoln St.David L. Ryan/Globe StaffFortis did not respond to a request for comment.While it’s not clear how much One Lincoln will fetch at auction, it’s fair to expect a far lower sum than the $1 billion valuation it commanded in 2022. That’s a reality facing many commercial real estate owners in Boston right now. Five years after COVID upended the city’s office market, a long-delayed reckoning on the value of office towers is coming, with major implications on the city’s tax base and the future of downtown.Advertisement“It’s like the stock market — it’s not a loss until you sell it,” said Dion Sorrentino, associate director of market analytics at CoStar Group in Boston. “They’re going to hold it for as long as they can.”For a dozen years after the 2008 financial crisis, commercial real estate prices steadily rose in Boston, generating eye-popping sales numbers and fueling the city’s budget. Rock-bottom interest rates made borrowing easy and cheap. Companies poured into downtown to tap the city’s talented young workforce. By the end of 2019, office vacancy was in the single digits and investors spent more than $8 billion that year alone to snap up commercial real estate that, by all accounts, was going to remain valuable for years to come.Then came the pandemic. Demand for office space plummeted, and today the vacancy rate is 21.1 percent, according to real estate firm Newmark. Meanwhile interest rates skyrocketed. That made it more expensive to borrow money for development projects and to refinance existing debt, particularly loans made at low, pre-COVID, interest rates.A developer has proposed converting 400 Atlantic Ave., a low-lying brick office facing Boston Harbor, into a hotel.David L. Ryan/Globe StaffDowntown landlords could hang on, for a time.While there are abundant smaller owners, many premier buildings in Boston are owned — in full or in part — by large real estate firms such as Boston Properties and Tishman Speyer; private equity like Rockpoint Group; or investment arms of pension funds or sovereign wealth funds, such as Oxford Properties and Norges Bank. Their deep pockets bought them time, and lenders offered extensions on repayments for a year or two, said Mark Fallon, director of research and strategy at real estate brokerage Hunneman in Boston.AdvertisementFor years, that “extend and pretend” phenomenon kept Boston’s commercial real estate sales market in relative stasis. Meanwhile owners fished for lucrative new leases to pay down their debt. The prospect of converting office to lab space — expensive, but with the potential to draw in high-paying life-science companies as tenants — continued to generate hope for a turnaround.But mostly, local owners have held off on selling for a simple reason, said Jeffrey Havsy of Moody’s Analytics.“They didn’t have to,” he said. “There was no forcing mechanism, if the debt wasn’t due.”Now though, those bills are coming due, prompting new momentum in the sales market. For many, the decision to sell will be difficult and costly: Havsy said many downtown buildings could sell for 40 to 60 percent of their pre-COVID price.The trend is one that city officials and financial watchdogs are monitoring closely. Some 71.1 percent of Boston’s $4.6 billion budget is funded by property taxes — much of it on commercial property — and price declines could hit that revenue hard. But the change could also lower rents, potentially broadening the number of tenants who can afford space downtown.Related: Corporate signs are proliferating on Boston's skylineA price reset, Havsy said, can also loosen up opportunities for investors with cash and patience, like Norges Bank. In December, an arm of the Norwegian sovereign wealth fund paid $248 per square foot for just over half of 33 Arch St., according to research from real estate firm Avison Young. That’s less than half the $606 per square foot that retirement behemoth TIAA paid to buy the 33-story downtown tower in 2011. (Norges bought out the first half of TIAA’s stake in 2013.)Advertisement“In a period of heightened dislocation in the office sector, we see this as an opportune moment to invest,” said Norges real estate executive Per Løken in a statement. Along with offices in San Francisco and Washington, D.C., Norges also bought just over half of 501 Boylston St. in Back Bay — noting its $194.9 million in existing debt — giving it full control of the building after it bought the first half in 2018.TIAA did not respond to a Globe request for comment.That kind of real estate calculus — or perhaps musical chairs — can get tricky fast, leaving a fair amount of uncertainty as to what buildings are actually worth. In the past five years, it’s been tough to discern the pandemic’s impact on office values, and, in turn, municipal tax revenues — in large part because many owners haven’t had to sell.“What is happening now is a reset,” said Jason S. Weissman, founder of Boston Realty Advisors. “And we’re seeing it all over.”Many of the city’s largest taxpayers are commercial landlords. One Lincoln, the tower up for auction in March, owes more than $15 million in net tax to the city this fiscal year. The 32-story office tower at 99 High St., which went up for sale in July, owes $8.6 million in net taxes. The value of those buildings has an outsize impact on city finances, one reason Mayor Michelle Wu last year sought to hike commercial tax rates to keep revenue flowing. That effort stalled in the state Senate, but she is trying again this year.The 32-story office tower at 99 High St. was listed for sale in July 2024.David L. Ryan/Globe StaffIndeed, a 40 percent to 60 percent decline in downtown property values could represent a mammoth hit to city finances. The Boston Municipal Research Bureau, an independent financial watchdog organization, in November explored how the city could diversify its revenue sources to not be so heavily dependent on property taxes.AdvertisementOf course, not all buildings are selling for a loss. An entity of Qatari investor Ezdan Holding Group paid $99.5 million for the 11-story office at 855 Boylston St. in Back Bay in fall 2023 — more than double what the property sold for in 2000. And, generally speaking, newer and higher-end buildings have maintained stronger demand from tenants willing to pay top-tier rents.But for buildings with low occupancy, it’s difficult to restructure debt, said Aaron Jodka, the director of US capital markets research for Colliers. That’s opening up avenues for buyers — family offices, sovereign wealth funds, and other private investors — who are seeing “a generational acquisition opportunity,” Jodka said, and sometimes a chance to try something other than office space.One example: JAJ Investment Group, the Luxembourg-based family office of French financier Jacques Chahine, plans to convert 400 Atlantic Ave. — a low-lying former law office facing Boston Harbor — into a hotel. The office was formerly the longtime home of Goulston & Storrs, which moved to nearby One Post Office Square last April.“When there is upheaval and change in the market, it does create new opportunities for others,” Jodka said. “Unfortunately, there’s usually the pain the previous owner has to go through.”Catherine Carlock can be reached at catherine.carlock@globe.com. Follow her @bycathcarlock.",
        "Outlet": "Boston Globe",
        "classifications": {
            "Real Estate Market Trends": 0.7424681782722473,
            "Real Estate Investment": 0.7143848538398743,
            "Residential Real Estate": 0.6771637201309204,
            "Real Estate Finance": 0.6669892072677612,
            "Commercial Real Estate": 0.6440562605857849,
            "Real Estate Legal": 0.6047871708869934,
            "Real Estate Technology": 0.5216553807258606
        }
    },
    {
        "url": "https://www.bostonglobe.com/2025/03/10/lifestyle/boston-luxury-towers-amenities-dog-spas-golf-simulator-indoor-pool/",
        "raw_pub_date": "2025-03-10",
        "pub_date": "2025-03-10T00:00:00",
        "hed": "A battle of amenities: Boston luxury towers compete on who can offer the most extravagant perks",
        "subhead": "",
        "content": "It was frigid out, and so icy that all over town pedestrians were tumbling. But on the 35th floor of the Millennium Residences at Winthrop Center, life felt as easy as a summer afternoon, and Richard Baumert was marveling at the lap pool: 75 feet long, surrounded by floor-to-ceiling windows, its water a bewitching shade of . . . let’s call it concierge blue.“You’re doing laps in the sky!” exclaimed Baumert, the managing partner of Millennium Partners. He sounded as awed as a child — and as strategic as a developer positioning his building against rival luxury buildings. “This is a huge draw for people.”Down on earth, where rents have grown punishing and some Bostonians are being pushed from their homes, affordable housing has become a central issue in the mayoral campaign.AdvertisementBut in the sky — the city’s new status neighborhood — the fight is not over meeting the basic needs of life, but over lifestyle. It’s a war of amenities. On beast mode.Club VIP is a pet day care and wellness spa in The Millennium Residences at Winthrop Center.Brett Phelps for The Boston GlobeIn a world where two-bedroom condos routinely go for $2 million plus, monthly homeowners associations costs can run you $2,000 or more, and penthouses sell for tens of millions of dollars, buildings are no longer just buildings. In the words of Ricardo Rodriguez, a Coldwell Banker luxury real estate agent, they’re “vertical country clubs.”There are resident-only restaurants run by fancy chefs. Golf simulators that come with a wet bar. Children’s playrooms that are so perfectly staged no children should be allowed. Decks landscaped to evoke the Mediterranean, screening rooms for private movie nights, IV drips, “Succession”-worthy work spaces, fitness centers with locker rooms more lavish than many homes. Places just for stretching. Service so gracious it spoils you for interactions with members of your own family.The golf simulation room is part of The Collective business club in The Millennium Residences at Winthrop Center.Brett Phelps for The Boston GlobeAt The Four Seasons One Dalton, not only is the driveway covered, the sidewalks are heated. EchelonSeaport has three pools, one with a waterfall and cabanas; and a basketball court that converts into a pickleball court. At Raffles Boston Residences, there are butlers and perhaps something even better — a framing for your life that sounds like it was written by Don Draper himself.Advertisement“Home,” the website reads. “It is here that we return time and again, after all our voyages of discovery. It is the beginning and end of every journey, a feeling we carry in our hearts, a memory that calls us back.”The basketball court and gym at Echelon Seaport.Brett Phelps for The Boston GlobeBut perhaps most important — and competitive of all — are amenities for the dogs.At The Millennium Residences at Winthrop Center in the Financial District, canine services include aromatherapy facials, ($50), agility training ($300 for six sessions), and luxury boarding at a New Hampshire farm ($105 a night).During a recent tour of the dog spa, Baumert said the building also offers canine acupuncture ($65) and Reiki. As he spoke, Lila, a long-haired Dachshund, looked on, perhaps eager to have her chakras read (for $50), or maybe saddened that she doesn’t live at The Sudbury in Bulfinch Crossing.The Raffles hotel in the Back Bay at 40 Trinity Place, Boston.David L. Ryan/Globe StaffThere, in addition to glorious outdoor spaces for humans — including a pool and an open-air ninth-floor “front porch” with rocking chairs — there’s outside space for dogs, too. To run, and also to relieve themselves.“Some buildings make them go indoors,” said Simona LaPosta, a real estate agent with Advisors Living, who was showing a reporter around. She allowed herself a quick wince, perhaps at the thought of the odor or maybe to drive home a selling point.Many of the city’s luxury towers have been built in areas that lack the charm of Back Bay or Beacon Hill, but who cares! There’s no need to ever leave (except to fly to your other homes).Club VIP is a pet day care and wellness spa in The Millennium Residences at Winthrop Center.Brett Phelps for The Boston GlobeAs David Bates, a real estate agent with William Raveis, wrote in his lively newsletter: “Bostonians once flaunted their social position by living in historic buildings with premier addresses. Today, however, the city’s wealthiest residents can flex their status by owning high-floor residences in Boston’s new residential skyscrapers.”AdvertisementIndeed, the city’s newest luxury tower, the Ritz-Carlton Residences, Boston, South Station Tower, is over a train station.But no matter. “Life Above the Clouds” is how the location is positioned on the website. “Beginning at an elevation of more than 450 feet” the residences “comprise a collection of extraordinary private homes and amenities in the sky.”The kitchen, dining, and living area at the Millennium Residences at Winthrop Center.David L. Ryan/Globe StaffIf we were in New York City, nicknaming convention would practically demand we call this new neighborhood “BoSky.”Just a generation ago, Boston was a town where even doormen weren’t that common. But in the summer of 2000, the game changed, according to a 2023 Globe Spotlight report on Boston’s housing crisis and the luxury tower building boom. That’s when the Trinity Place condo building opened in Copley Square, with a then-astonishing claim: that life there would bring a “Total Fulfillment of Needs.” Since then, more than 50 sizable developments featuring multimillion-dollar condos — both new construction and renovations — have opened in Boston.And by now, woe to the building that doesn’t offer at least a dog-washing station, indoors though it may be.The game room in The Millennium Residences at Winthrop Center.Brett Phelps for The Boston GlobeIn late February, Bates, the real estate agent, did a keyword search for amenities in the 763 condos on the Boston market. The goal was to see what’s become a must-have — even in nonluxury buildings.“Concierge,” he said, reading out a keyword. “There are 224, even some in East Boston. One hundred and forty-one [listings] have a pool. Decks, that’s 268. Valet, there are 95. Forty-nine have some kind of sports simulator.”AdvertisementA few years ago, with amenity madness blooming, the term “fully amenitized” entered the lexicon (with coinage claimed by power broker Maggie Gold Seelig) and now it’s even arrived in Beacon Hill.The library lounge at Echelon Seaport.Brett Phelps for The Boston Globe“The Archer Residences joined two historically significant buildings to create the first fully amenitized, full-service luxury condominium in Beacon Hill,” reads the website for the seven-story project on Temple Street.Alas, even in BoSky, sometimes there must be a nod to reality. As the website for Ritz-Carlton Residences over South Station tries to boast, the location provides “. . . immediate vehicular access to I-90, I-93 and the Ted Williams Tunnel.”There’s one nightmare no amount of amenitization can buy you out of: Boston drivers.Choose a lane, buddy!The lounge in The Millennium Residences at Winthrop Center.Brett Phelps for The Boston GlobeBeth Teitell can be reached at beth.teitell@globe.com. Follow her @bethteitell.",
        "Outlet": "Boston Globe",
        "classifications": {
            "Real Estate Investment": 0.7505901455879211,
            "Residential Real Estate": 0.61376953125,
            "Real Estate Finance": 0.5970485210418701,
            "Real Estate Legal": 0.5913238525390625,
            "Real Estate Market Trends": 0.4101226329803467,
            "Real Estate Technology": 0.3987177014350891,
            "Commercial Real Estate": 0.23132751882076263
        }
    },
    {
        "url": "https://www.bostonglobe.com/2025/03/04/business/morrissey-boulevard-high-rise-towers/",
        "raw_pub_date": "2025-03-04",
        "pub_date": "2025-03-04T00:00:00",
        "hed": "High-rises on Morrissey Boulevard? Developer pitches 18-story towers near JFK T stop.",
        "subhead": "The two 18-story towers would bring 754 apartments to Morrissey Boulevard in Dorchester",
        "content": "A team of Boston developers and Chicago investors have unveiled their designs for a pair of 18-story apartment towers on the site of the former WLVI television studio in Dorchester, the first phase of an already approved project that would bring five other buildings to that stretch of Morrissey Boulevard.Local development firm Copper Mill and an entity managed by Chicago-based investor POB Capital are proposing two towers with a combined 754 apartments near the JFK/UMass MBTA stop, next to the former headquarters of The Boston Globe, now a lab and office complex called Southline.The development team “is committed to delivering a mixed-use program that serves the long-term interests of Savin Hill, Columbia Point and greater Dorchester neighborhoods,” wrote Andrew Flynn, Copper Mill’s founder and chief executive, in a December letter to the Boston Planning Department.AdvertisementA rendering of two 18-story residential towers proposed at 75 Morrissey Blvd. in Dorchester.CBTDesigned by Boston-based CBT Architects, the towers — one at 204 feet facing Morrissey Boulevard, another at 206 feet facing Interstate 93 — would each have three levels of underground parking. Between them, the developers have planned a roughly half-acre community park.The Morrissey Boulevard project stretches nearly 9 acres from 35-75 Morrissey Blvd., including the Star Market grocery store and former TV studio along with the former Beasley Media radio studios. A seven-building master plan, approved by the Boston Planning and Development Agency board in 2023 — albeit under a different developer — calls for three apartment buildings and four office/lab buildings.The BPDA board-approved master plan calls for a grocery store to be included within the third planned residential tower. The radio site at 55 Morrissey Blvd. now houses The Record Co., which offers affordable recording studio and rehearsal spaces. Beasley relocated to Waltham last year, and The Record Co. has said it intends to stay in 55 Morrissey through January 2027.The development would include a community park between the two new residential towers.CBTOf the 754 apartments planned at 75 Morrissey Blvd., about 150 — or 20 percent — would be set aside as affordable. Copper Mill said it intends to start construction in the first half of next year, wrapping up by early 2029.The site is located across Morrissey Boulevard from the mammoth 21-building Dorchester Bay City mixed-use project. The BPDA board approved the master plan for that 36-acre project in fall 2023.AdvertisementCopper Mill is also proposing a 25-story apartment tower on Elm Street in Somerville, a project that earlier this year prompted dueling flyer wars. Flynn was formerly the top local executive of London-based private student housing developer Scape, which in 2019 explored building a 250-unit apartment tower and two years later proposed lab space at the Davis Square site.Catherine Carlock can be reached at catherine.carlock@globe.com. Follow her @bycathcarlock.",
        "Outlet": "Boston Globe",
        "classifications": {
            "Residential Real Estate": 0.6754511594772339,
            "Commercial Real Estate": 0.4387836456298828,
            "Real Estate Legal": 0.2985571622848511,
            "Real Estate Market Trends": 0.2676246166229248,
            "Real Estate Investment": 0.2383985072374344,
            "Real Estate Technology": 0.16341179609298706,
            "Real Estate Finance": 0.12828698754310608
        }
    },
    {
        "url": "https://www.bostonglobe.com/2025/03/09/business/women-in-construction-week-boston/",
        "raw_pub_date": "2025-03-09",
        "pub_date": "2025-03-09T00:00:00",
        "hed": "Climbing higher: Women in Construction Week celebrates a growing demographic in the industry",
        "subhead": "Roughly one in nine construction workers are female, and their ranks are growing",
        "content": "Nationally, women comprise just 11 percent of construction workers and 4 percent of the skilled trades workforce. Women in Construction Week, celebrated across the US from March 2 through 8, aims to promote women in the field — and create pathways for more to join.Some of that work is already going on locally. In December, Governor Maura Healey signed an executive order aimed at increasing participation of women and historically underrepresented groups in construction.“Here in Massachusetts, we know that we get the best results when our workforce reflects the rich diversity of the people of our state,” Healey said then.Plumber Maria Zammitti, working at 585 Kendall in Cambridge; her mother was a construction worker in the 1980s.David L. Ryan/Globe StaffLauren Slaven, a senior superintendent at construction management firm Shawmut Design and Construction in Boston, has spent more than two decades in the industry. When Slaven arrived at Wentworth Institute of Technology in 2000, she wanted to be an architect. But through the school’s co-op program, she found herself at a construction meeting detailing renovation plans for the Harvard University Faculty Club. The project superintendent commanded the room, understood all aspects of the job, and was pushing it to the finish line.“I was like: I want that guy’s job,” Slaven said.Related: From 2023: A movement is building to get women into constructionAdvertisementSlaven on Thursday won the mentorship award at the Associated General Contractors of Massachusetts annual Inspire Awards, which honor exemplary women in the construction business.At Shawmut, Slaven started with a three-year rotation program, spending one year learning project management, another learning estimating, and another learning the role of a superintendent. When she started, maybe one-quarter of her rotation’s 20-person cohort were women. The most recent cohort was about half women, she said.Kumba Wahkor (center) rode the hoist/elevator to the sixth floor of 585 Kendall.David L. Ryan/Globe StaffShawmut’s culture is one where teammates push for others to improve and rise up, Slaven said, whether it be giving someone credit or being an unofficial mentor.“Their generosity and inspiration and really what they saw in me that I may not have seen in myself — they really believed in me from the beginning,” Slaven said. “I thought to myself: I need to be paying this forward. Mentorship is a critical role. Because it’s not just about teaching technical skills to somebody else. It’s about inspiring somebody’s confidence, and encouraging their growth.”AdvertisementIronworker Hannah Cahill at 585 Kendall in Cambridge.David L. Ryan/Globe StaffAt the AGC awards, Lieutenant Governor Kim Driscoll emphasized the importance of a diverse workforce and how the administration values diversity, equity, and inclusion, drawing strong applause from the nearly 1,000 attendees.“What makes Massachusetts a strong state is the fact that we have a rich mix of people, a rich tapestry of communities,” Driscoll said. “What makes us special, I think, is that we recognize that when we utilize everyone, when we make room at the table for people who may not have historically been at that table, we get better outcomes, better results.”Ironworker Shellian Capo-Chichi on site at 585 Kendall.David L. Ryan/Globe StaffCatherine Carlock can be reached at catherine.carlock@globe.com. Follow her @bycathcarlock.",
        "Outlet": "Boston Globe",
        "classifications": {
            "Residential Real Estate": 0.8096430897712708,
            "Real Estate Market Trends": 0.7141789793968201,
            "Commercial Real Estate": 0.688387930393219,
            "Real Estate Technology": 0.6715966463088989,
            "Real Estate Investment": 0.5583686828613281,
            "Real Estate Legal": 0.46124616265296936,
            "Real Estate Finance": 0.4300152063369751
        }
    },
    {
        "url": "https://www.bostonglobe.com/2025/03/12/business/formerly-homeless-find-new-home-jamaica-plain/",
        "raw_pub_date": "2025-03-12",
        "pub_date": "2025-03-12T00:00:00",
        "hed": "Years in the making, a new home for formerly homeless people opens in Jamaica Plain",
        "subhead": "A five-story, $105 million permanent supportive housing building is celebrating its grand opening on Washington Street",
        "content": "Michael Montanino grew up in East Boston, around the corner from Santarpio’s, a foster kid in a house with nine other children. He dealt with learning disabilities and lingering effects of malnutrition from his earliest years, then went on to run track in high school and graduate from North Shore Community College.Montanino struggled with alcoholism in his college years — a problem that led him to living on the streets for nearly two years. He’d bounce back and forth from the Constitution Beach Walk to Jeffries Point, to the library and the flower shop. Sometimes he did food app delivery on foot for $7 an order.“That was my homeless life, just going from one thing to another ... never really knowing where my next meal was coming from,” he said.AdvertisementThese days, though, Montanino is calling Jamaica Plain home. He’s one of the new residents at 3368 Washington St., a five-story, $105 million residential building celebrating its grand opening on Wednesday. Developed by Boston-based The Community Builders and homeless services provider Pine Street Inn, the building — to be named “The Lyndia” in honor of Pine Street Inn executive director Lyndia Downie — is the largest permanent supportive housing development in New England. The 202-unit building includes 140 studios for formerly unhoused people referred by Pine Street in one wing, and 62 affordable units for families in another.The city of Boston provided some $17.3 million to the project, and supported it amid a lengthy lawsuit that challenged its zoning.Related: ‘Permanent supportive housing’ may be controversial to would-be neighbors, but it’s been beneficial to those who live in it | Shirley Leung“To solve homelessness, you have to tackle the roots of the problem, which is making sure that people can have a home, and have support in living in their homes,” said Boston Mayor Michelle Wu. “You really have to have a plan for homes to be accessible and supportive for everyone.”Downie has long championed permanent supportive housing, which is basically an apartment with social services on site, and Pine Street has gradually grown its inventory of such buildings in recent years. Advocates say tackling the roots of homelessness requires more than just handing out grants, and instead making sure individuals have both a roof over their heads and access to health and wellness support systems to guide them through a world-upending transition. Montanino said he is frequently connected with security and outreach personnel, case managers, a personal landlord, and property managers, all of whom helped him move — and stay — off the streets.Advertisement“They’re all hands on deck here,” he said.Michael Montanino in his new unit at 3368 Washington St.Jonathan Wiggs/Globe StaffThe 3368 Washington project includes support services like onsite mental health counseling, 24/7 security, and key fob-activated elevators. Residents are directly referred by Pine Street Inn. On a recent tour of the building, fliers for workforce development programs with Pine Street and Roxbury Community College were available for anyone to read.The property was formerly a low-slung warehouse, which Pine Street bought in 1997 and over the years used for a variety of functions, including office space for case workers and a small woodworking program. As Pine Street ramped up its housing development efforts, the site stood out, particularly given its proximity to the Green Street Orange Line station. Most developers responded to Pine Street’s bid for proposals with pitches for around 40 to 60 units, Downie said. But Bart Mitchell, CEO of The Community Builders, aimed higher.“Bart and I went over to look at the site, and Bart, even that day, said, ‘Look, if we can get some height relief, we can do something really sustainable here. We can get some scale,’” Downie said. “That was what, for us, was so exciting. ... The more long-term people you can move out, the better chance you have of meeting shelter demand.”The project hasn’t been without its challenges. The landlord of a neighboring property sued in 2020, alleging the zoning process to allow the project was flawed. Though the lawsuit eventually settled, the delay cost “multiple millions” of dollars, said Andy Waxman, Community Builders’ senior vice president of real estate.AdvertisementPine Street and The Community Builders are collaborating on similar projects, including 900 Morrissey Blvd. in Dorchester, which is under construction now. While many community groups in Jamaica Plain, including the Egleston Square Neighborhood Association and the Jamaica Plain Neighborhood Council, supported 3368 Washington, other projects across the city have seen fierce pushback from neighborhoods.The exterior of 3368 Washington St. in Jamaica Plain. The 202-unit project will include 140 units designated for supportive housing for individuals referred by Pine Street and 62 units for families.Jonathan Wiggs/Globe Staff“It’s an unknown for a lot of people, so I think it creates more anxiety for people — in an understandable way — not knowing exactly what it is,” Waxman said. “Permanent housing with the level of support that Pine Street Inn provides — that combination is great. And so it takes people some time to learn that.”Potential residents apply through the Boston Housing Authority, and then are screened by Pine Street. Folks have moved in gradually over the past few months, Downie said, and the building is expected to be full by June.With a gentle demeanor and a quick smile, Montanino proudly showed off his new home last week. He’s learning to cook, and there are spices and oil next to his stove — he’s done steaks and chicken, burgers, and salads. He’s volunteering, and has lined up a job — he starts in April. He dreams of adopting a child, as his mother did him.“My life’s back,” Montanino said. “I get up early in the morning. I count my blessings, for sure.”Catherine Carlock can be reached at catherine.carlock@globe.com. Follow her @bycathcarlock.",
        "Outlet": "Boston Globe",
        "classifications": {
            "Real Estate Finance": 0.925166130065918,
            "Real Estate Investment": 0.9237673878669739,
            "Real Estate Legal": 0.898941159248352,
            "Residential Real Estate": 0.8726525902748108,
            "Real Estate Technology": 0.8024203777313232,
            "Real Estate Market Trends": 0.6726433038711548,
            "Commercial Real Estate": 0.564576268196106
        }
    },
    {
        "url": "https://www.bostonglobe.com/2025/03/03/business/josh-kraft-michelle-wu-rent-control/",
        "raw_pub_date": "2025-03-03",
        "pub_date": "2025-03-03T00:00:00",
        "hed": "Josh Kraft wants to bring rent control back to Boston. But not the same rent control as Michelle Wu proposed.",
        "subhead": "The proposal by Mayor Michelle Wu’s challenger is not really rent control in the traditional sense, housing experts and political observers say. Regardless, his embrace of the term appears to be a calculated move.",
        "content": "On the day he launched his mayoral campaign, Josh Kraft went on the offensive, assailing Mayor Michelle Wu over her record on bike lanes and housing construction. That was no surprise.But one avenue of attack raised eyebrows across the city. Kraft said he would make good on a progressive policy promise that Wu had tried but failed: Bringing rent control back to Boston.“Mayor Wu promised us rent control three years ago,” Kraft said. “We will deliver it finally.”That Kraft, the son of billionaire Patriots owner Robert Kraft and a favored candidate in some corners of the business community, would lean into an issue that many economists believe does more harm than good and most landlords despise, signals just how big a problem the cost of housing has become for everyday Bostonians. Yet the specifics of his proposal suggest he’s trying to walk a fine political line to appeal to two very different political constituencies that rarely see eye to eye: the business community and tenants.While Kraft calls his proposal rent control, housing experts and political observers said it is not really rent control in the traditional sense of the hard rent caps seen in New York City, San Francisco, and Boston before state voters outlawed them here in 1994. It is instead an optional program for landlords who would receive tax breaks if they agree to cap annual rent increases. While it could be appealing for property owners to participate, it is not mandatory. And critics argue Kraft’s plan may simply provide some landlords with tax breaks, while doing little to protect struggling renters.Related: Josh Kraft’s tax break for ‘good landlords’ already exists, and the Boston City Council just voted for itAdvertisementBut his embrace of a term once considered politically untenable appears to be a calculated move. The idea of rent control has become increasingly popular in some corners of the city as rents climb relentlessly upward. And these days, political observers say, winning an election in Boston requires a whatever-it-takes approach to housing affordability.“[Kraft’s proposal] is not rent control, but the fact that he’s proposing it shows how significant an issue housing has become for the city,” said Josh Zakim, a former city councilor who served alongside Wu and who now runs a housing advocacy group. “It’s the biggest issue facing the city and the Commonwealth, and I don’t think you can run a serious campaign for public office here without a plan to address it.”AdvertisementKraft’s plan takes considerable cues from the version of rent control that Wu tried unsuccessfully to push through the state Legislature in 2023. Like Wu’s plan, it would tie allowable rent hikes to inflation, with a hard cap of 10 percent per year. While Wu’s set no income guidelines, Kraft’s plan would be open to tenants who make less than 200 percent of the Area Median Income, more than $300,000 for a family of four, which he said would prevent luxury buildings from participating.Mayor Michelle Wu looked on as the City Council voted to approve her proposal to restore rent control in Boston in 2023. The measure later died on Beacon Hill.Jonathan Wiggs/Globe StaffThe biggest differences are that Kraft’s program would be optional for landlords, and would come with a sweetener: property tax breaks of 20 percent for participating buildings. Kraft said he’d pay for that with tax revenue generated by new residential construction, which he hopes to spark by lowering affordable housing requirements.The city requires 20 percent of units in new developments to be set aside at affordable rents. Kraft wants to lower it to 13 percent, the rule that was in place before Wu took office.Kraft’s campaign said that because the money would be distributed to landlords in the form of grants, as opposed to formal tax rebates, his plan would not need to go through the state Legislature (though that point is disputed by some advocates and legislators).“Josh’s opt-in rent control plan would provide real relief to renters, unlike Mayor Wu’s failed plan that has helped no one,” the Kraft campaign said in a statement. “This is yet another unfulfilled promise which Mayor Wu needs to explain to voters instead of calling names and making excuses.”Related: Who is Josh Kraft, the nonprofit leader and son of the Patriots owner challenging Michelle Wu for mayor?AdvertisementFor her part, Wu assailed Kraft’s plan, calling it “fake rent control.” She said he is using the promise of rent control to win over struggling renters who are hurting, while offering them no real protections.“This program, a voluntary program, is not going to … protect against the worst offenders [of extreme rent hikes],” Wu said on GBH’s Boston Public Radio last week. “It is a use of resources without offering the types of protections that we really need.”Wu has not reintroduced her rent control plan since it died in the Legislature last year.So far, no prominent tenant groups have come out in support of Kraft’s plan, but it’s getting a positive reception among some real estate interests, who lobbied against Wu’s plan and ultimately helped sink it on Beacon Hill.Developers and landlords generally oppose mandatory rent caps because they limit a building’s profitability, making it more difficult to attract the investors needed to build and therefore slowing new construction. They’re also a political constituency that appears at least intrigued by — if not yet openly supportive of — Kraft’s candidacy.“We have long been opposed to rent control because we have seen the impact it has on housing production,” said Tamara Small, chief executive of real estate trade group NAIOP Massachusetts, which does not endorse political candidates. “When the investors that finance housing development hear the words rent control, they flee. But this proposal is clearly different. I don’t think it would hurt production the way [Wu’s] proposal would.”AdvertisementAn apartment building under construction in Jamaica Plain last year. New construction has slowed in Boston amid higher interest rates and materials costs. Mayoral challenger Josh Kraft has said he'd lower affordable housing requirements to help boost new projects.Jessica Rinaldi/Globe StaffWhile it’s unclear how many landlords may opt in to such a program, some have already indicated they may be interested. In some cases, the program may actually be profitable for landlords, as they’d get tax breaks even in years when they wouldn’t normally raise the rent above the proposed cap.Take Chris Lehman, cofounder of real estate investment group Groma. His group typically raises rent by an average of 3 to 5 percent a year across its more than 300-unit portfolio, well below the cap Kraft proposes. He conducted a financial feasibility analysis of Kraft’s plan at the request of his campaign, and found that savings on taxes would make up for lost rent. He said he would consider enrolling the majority of his units.Related: Lessons in modern-day rent control, 3,000 miles from Boston“If there were an actual rent control, we would of course oppose it,” he said. ”But this program could mean lower rent increases for our residents without hurting development.”What remains to be seen is whether Kraft’s rent moderation policy will be enough to win over housing advocates and tenants who have historically come out in force for Wu and who have often demanded stronger affordability requirements in new development. At least one group of advocates, the Coalition for a Truly Affordable Boston, is more focused on his plan to cut affordability, which they called a “direct attack on Boston’s affordability and housing justice efforts.”“Increasing housing supply alone does not guarantee affordability — especially when developers are not required to build homes that meet the needs of our residents,” said Shameeka Moreno, a member of the Boston Tenant Coalition.AdvertisementAnd lawmakers who’ve long worked on housing issues say they’re skeptical that Kraft’s plan would generate enough affordable units to cancel out the ones lost by lowering affordable housing requirements, or do much to control Boston’s soaring rents at all.“He doesn’t know the meaning of the words he’s using — it’s not rent control,” said State Senator Lydia Edwards, a Wu ally and former city councilor from East Boston. “I welcome creative policy solutions and that this is a major issue in the mayor’s race. But this feels like he’s using the term rent control in order to try to get some attention and some headlines.”Andrew Brinker can be reached at andrew.brinker@globe.com. Follow him @andrewnbrinker.",
        "Outlet": "Boston Globe",
        "classifications": {
            "Residential Real Estate": 0.8652111291885376,
            "Real Estate Market Trends": 0.7922114133834839,
            "Real Estate Investment": 0.7796926498413086,
            "Real Estate Legal": 0.7412787675857544,
            "Commercial Real Estate": 0.7129697203636169,
            "Real Estate Finance": 0.7115518450737,
            "Real Estate Technology": 0.5156193971633911
        }
    },
    {
        "url": "https://www.bostonglobe.com/2025/03/06/business/federal-buildings-trump-administration-non-core-sale-list/",
        "raw_pub_date": "2025-03-06",
        "pub_date": "2025-03-06T00:00:00",
        "hed": "The Trump administration took down a list of 400-plus federal buildings it might sell. Here’s what was on it.",
        "subhead": "The since-deleted list of ‘non-core’ federal buildings included 20 in New England, including a brand-new, half-billion-dollar transportation research center in Cambridge",
        "content": "The agency managing federal real estate sparked quite a kerfuffle on Tuesday when it published a list of more than 400 buildings across the country and in Puerto Rico that it deemed “non core” to government operations and thus ripe with redevelopment potential.The General Services Administration said many of the 443 properties — including the newly built $530 million Volpe Transportation Systems Center in Cambridge that replaced a 1970s-era office — were “functionally obsolete.”Related: Trump administration lists federal buildings in Mass., nationwide, that it might put up for sale.But other properties on the list are not as up to date, such as the John F. Kennedy Federal Building, a 1960s-era pair of 26-story towers and four-story office abutting Boston’s City Hall. The administration said it would consider selling the 443 properties or pursue other deals — public-private partnerships, ground leases, sale-leasebacks — along with possible co-working agreements between government agencies.AdvertisementBy Wednesday, however, the full “non-core property list” was no longer available on the GSA website. Instead, the list is advertised as “coming soon.” The Boston Globe saved a copy; check out the full list below.There are 20 properties in New England on the list — two in Connecticut, four in Maine, nine in Massachusetts, one in New Hampshire and four in Vermont. (Rhode Island’s federal buildings were not included.)In a Wednesday statement, the GSA said it received “an overwhelming amount of interest” and that it anticipated republishing the list “in the near future after we evaluate this initial input.”“Just because an asset is on the list doesn’t mean it’s immediately available for sale,” the GSA’s Wednesday statement said.Catherine Carlock can be reached at catherine.carlock@globe.com. Follow her @bycathcarlock.",
        "Outlet": "Boston Globe",
        "classifications": {
            "Residential Real Estate": 0.7146681547164917,
            "Real Estate Legal": 0.7014733552932739,
            "Real Estate Investment": 0.673194169998169,
            "Commercial Real Estate": 0.6654168963432312,
            "Real Estate Technology": 0.6633228659629822,
            "Real Estate Market Trends": 0.6046485900878906,
            "Real Estate Finance": 0.590332567691803
        }
    },
    {
        "url": "https://www.bostonglobe.com/2025/03/05/business/tariffs-housing-costs-lumber-construction/",
        "raw_pub_date": "2025-03-05",
        "pub_date": "2025-03-05T00:00:00",
        "hed": "How tariffs on Canada will make new housing more expensive in New England",
        "subhead": "Apartment buildings need a lot of wood. And around here, wood mostly comes from Canada.",
        "content": "There are two main ingredients in cost of building housing: labor and materials. Here in New England especially — where builders have long wrestled with the cost of construction — the 25 percent tariff on Canadian imports instituted this week by President Trump will make the latter even more expensive.Much of the softwood lumber and mass timber that goes into apartment buildings in Massachusetts comes from Canada, as does fabricated steel and aluminum. While costs vary, it’s typical for materials to make up between 40 and 50 percent of a construction budget — with anywhere from 6 to 12 percent of that coming from imported goods, said Mike Kearns, chief operating officer of the New England region for construction management firm Shawmut Design and Construction in Boston.New tariffs are likely to spark a domino effect on costs, he says. A 25 percent premium on Canadian lumber could prompt a run on domestic suppliers — a market that’s already at maximum capacity, Kearns said — which will in turn likely bring those domestic prices up, and further extend an already stressed supply chain.Related: The $600,000 problem: Why it costs so much to build housing in Greater BostonAdvertisementBuilders are constantly on the hunt for ways to bring costs down, but the tariffs are likely to affect whether a project’s economics work — and whether builders can build. Indeed, in the Northeast, lumber costs comprise typically 15 to 18 percent of the cost of building a new home.“It’s always this balancing act,” Kearns said. “If that value proposition isn’t there, then that’s when you could see something pause.”Kearns stressed, however, that the industry is “a long way from seeing [tariffs] shut down work,” and that there are ways to navigate costs.Still, any adjustment in the existing tariffs on Canadian softwood lumber results in almost universal groans among wood suppliers who watch the changes closely, said Paul Rogers, purchasing manager at Shepley Wood Products, a supplier with offices in Hyannis, Nantucket, and Wellfleet. If the price of Canadian lumber effectively goes up 25 percent, the price charged by American mills in turn “goes up in sympathy,” Rogers said.“Everybody follows the numbers,” Rogers said. “It doesn’t matter what side of the border it’s coming from.”AdvertisementThe margin on lumber is already slim — “in the single digits,” Rogers said — and tariffs further limit a lumber supplier’s ability to negotiate pricing. Canadian softwood lumber like spruce, pine, and fir have carried tariffs since 1980, said Shepley president Tony Shepley. Now those will go up even higher.An apartment building under construction in Everett in 2023.David L. Ryan/Globe StaffFor development projects in the Northeast, architects will often specify that they want Canadian softwood lumber — both for how it’s grown and how it survives in the Northeastern climate, said Rita Ferris, president of the Northeastern Retail Lumber Association, which represents independent lumber and building material suppliers from Maine to Washington, D.C.There’s huge concern about tariffs further slowing development of residential housing, which has already faced huge cost pressures, Ferris said.“We just don’t grow enough of our own to meet our own demands,” Ferris said. “We totally get the goal of putting America first and having American workers and all of that. But if you can’t supply yourself, it’s really an extra burden.”Tariffs are of course nothing new to the construction industry. Prior presidential administrations have instituted tariffs on materials including steel and lumber, boosting their overall price, wrote Paul Brussow, president of Rider Levett Bucknall North America, in the firm’s recent quarterly construction cost report. That report saw typical costs in Boston climb 5.4 percent over the last year, second only to Chicago among major markets.“While tariffs have had an impact, it was nothing compared to what inflation has done in recent years,” Brussow wrote in January. “When coupled with inflation and labor shortages, this trifecta, in the last few years, has strained supply chains, raised construction costs, and affected project timelines.”Related: A 10,000-unit housing development at Suffolk Downs is on hold indefinitely. Here’s why.AdvertisementAdditional tariffs “are more likely to exacerbate these challenges, particularly for metals, plastics, and essential construction materials, potentially adding thousands to the cost of residential and commercial projects,” Brussow wrote.For Riverdale Mills, a Northbridge company that makes steel wire mesh used in products like fences and lobster traps, the new tariffs are a one-two punch of bad news. Riverdale buys much of its steel from Canada — and an additional 25 percent tariff on steel will kick in on March 12. So by mid-month, the company will be paying 50 percent more for its most important raw material.The company’s chief executive, James Knott Jr., said Riverdale can’t avoid the tariffs by buying American steel, because US steelmakers used the tariffs as an excuse to jack up their own prices. They didn’t even wait for the tariffs to begin.“Back in February, the domestic guys all raised their prices in advance of those tariffs,” Knott said.Knott has no intention of switching to a US source.“Rather than buy from a domestic supplier, I’m going to buy from my reliable supplier in Canada,” said Knott, “because all the prices are equal.”Ironically, Knott said that most of the US suppliers are foreign-owned, but his Canadian supplier is owned by a US firm.The tariffs will harm him in another way, said Knott. About 35 to 45 percent of Riverdale’s products are exported. But since the tariffs have boosted his production costs, his exported steel mesh will be too expensive to compete on world markets.Meanwhile Shepley of Shepley Wood Products said he would hope for “common sense and cooler heads” to prevail.Advertisement“It’s our mission as an industry to protect consumers, to not let housing get driven further out of reach, and to get things settled down,” Shepley said. “So this was a bit of a shock to the system, but we’ll hope that everybody pulls themselves together and gets this going.”Steel and lumber, two major components in housing construction, both face substantial price increases amid 25 percent tariffs on imports from Canada.David L. Ryan/Globe StaffCatherine Carlock can be reached at catherine.carlock@globe.com. Follow her @bycathcarlock. Hiawatha Bray can be reached at hiawatha.bray@globe.com. Follow him @GlobeTechLab.",
        "Outlet": "Boston Globe",
        "classifications": {
            "Residential Real Estate": 0.8341859579086304,
            "Real Estate Investment": 0.832496702671051,
            "Real Estate Finance": 0.826924741268158,
            "Real Estate Market Trends": 0.7984685897827148,
            "Real Estate Legal": 0.779863715171814,
            "Real Estate Technology": 0.5968027710914612,
            "Commercial Real Estate": 0.34179019927978516
        }
    },
    {
        "url": "https://www.bostonglobe.com/2025/03/06/business/everett-boston-pumphouse-mystic-river-ferry-terminal/",
        "raw_pub_date": "2025-03-06",
        "pub_date": "2025-03-06T00:00:00",
        "hed": "A new ferry terminal on the Mystic? Boston, Everett officials team up to restore old pumping station.",
        "subhead": "",
        "content": "Thousands of drivers whiz by the vacant brick building perched precariously over the Mystic River every day without giving it a second thought. But city officials in Everett and Boston have been giving this former sewage pumphouse a lot of thought lately, as they eye it for potential restoration and redevelopment amid the broader rebirth underway around the Encore Boston Harbor casino across the street.Although it’s on the Everett side of the river, the 15,000-square-foot pumphouse actually sits within a tiny sliver of Boston that extends along Alford Street (Route 99). Consultants are about to finish studying the feasibility of redoing the 19th-century building, as soon as this month, on behalf of the cities of Everett and Boston, and funded by state gaming commission funds.Ideas have ranged from turning it into a community center, to a kayak and canoe launch, to a beer hall. The leading concept, though, seems to be a ferry terminal, in part because the Kraft Group is eyeing the site next door to build a soccer stadium for the New England Revolution.“We’re really excited about it,” said Patrick Herron, executive director of the Mystic River Watershed Association. “What a way to breathe life into a historic building on the edge of the water.”AdvertisementKathy Abbott, chief executive of the nonprofit Boston Harbor Now, said the site is an ideal location for a ferry terminal because it’s on the Boston Harbor side of the Alford Street bridge, whose low height prevents many commercial boats from passing under it. (Casino owner Wynn Resorts commissioned ferries purpose-built to fit under the bridge to serve casino customers.)While a boat landing could help with game-day transit for pro soccer games, Abbott said any terminal’s full potential would depend on whether other public transportation projects proposed for the area come to fruition, such as a Silver Line bus-rapid-transit extension or a new commuter rail stop next to the casino.The conversations around the pumphouse, currently owned by the Massachusetts Water Resources Authority, started a few years ago, long before state lawmakers approved legislation in November that rezones the adjacent site for a soccer stadium. That legislation removes the site next door, home to a shuttered power plant, from what’s known as a Designated Port Area, where only marine industrial uses can be developed.AdvertisementHowever, per state officials, the legislation left the pumphouse property in the DPA. That could pose a challenge to any redevelopment of the site, although a ferry terminal would be an allowed use within the zone. Other challenges include the limited space for parking and a dilapidated seawall that needs to be shored up.Herron said he expects state regulators would be willing to remove the site from the DPA because it’s not currently home to industrial use. (The MWRA stopped pumping at the facility in 1993, replacing it with a more modern facility across the street, though an active sewer pipe passes under one portion of the 1890s building.)Everett and Boston officials are also engaged in discussions about a harborwalk extension that would bring the path along the Mystic River from the casino across the street, under the Alford Street bridge, and around the pumphouse to the stadium site.Tom Philbin, an environmental planner with Everett Mayor Carlo DeMaria’s administration, said Massachusetts Gaming Commission grants have so far provided nearly $250,000 to design the 1,500-foot harborwalk extension and around $200,000 to study the feasibility of restoring the pumphouse. (The money comes out of community mitigation funds overseen by the gaming commission for casino host cities and nearby communities.)In a preliminary community agreement signed with DeMaria in late 2023, the Kraft Group agreed to pay for completing the harborwalk extension from the casino to the soccer stadium site. However, the Revs and Patriots ownership is not currently involved in the talks around the pumphouse’s future.AdvertisementStacy Thompson, interim executive director at Historic Boston, the primary consultant studying the pumphouse’s viability, said the restoration hinges on the eventual price tag. But she remains hopeful that the pumphouse could become an important piece in the broader mosaic of this new urban neighborhood gradually taking shape. At this time, any final decision on the building’s fate would ultimately be up to the MWRA.“There’s so much potential,” Thompson said. “Could it be a ferry station or a landing point? Yes. Could it be something else that serves the community? Yes. We’re not there yet [but] we’re getting closer to understanding what’s possible.”Jon Chesto can be reached at jon.chesto@globe.com. Follow him @jonchesto.",
        "Outlet": "Boston Globe",
        "classifications": {
            "Real Estate Investment": 0.934687077999115,
            "Real Estate Finance": 0.9339209198951721,
            "Real Estate Technology": 0.9303216934204102,
            "Real Estate Legal": 0.9214636087417603,
            "Residential Real Estate": 0.8808124661445618,
            "Real Estate Market Trends": 0.8738240003585815,
            "Commercial Real Estate": 0.814800500869751
        }
    },
    {
        "url": "https://www.bostonglobe.com/2025/03/04/business/massachusetts-development-woburn-regional-transportation/",
        "raw_pub_date": "2025-03-04",
        "pub_date": "2025-03-04T00:00:00",
        "hed": "State offers up Woburn regional transportation hub as new development option",
        "subhead": "There’s one hitch: The site has a legacy of industrial contamination",
        "content": "Massachusetts state officials have offered up a prime location in Woburn for development: the 26-acre Anderson Regional Transportation Center.The transportation hub, at 100 Atlantic Ave., is owned by a joint venture of the Massachusetts Port Authority, the Massachusetts Department of Transportation, and the Massachusetts Bay Transportation Authority, and is home to a station for the MBTA’s Lowell commuter rail line, Amtrak’s Downeaster line, and Massport’s Logan Express shuttles. Any development would need to retain or enhance the various transit uses. However, because of a history of pollution there, residential and school uses are currently not allowed.The goal is to find a developer willing to take some or all of the 2,400 surface parking spaces and consolidate them in a multi-level garage, opening up land for development. For now, the transit agencies are seeking “expressions of interest” from developers to better understand the site’s potential and the market demand. Responses are due by April 30.Other development activities nearby include the rezoning of 53 acres east of the rail line, to allow for multifamily construction in compliance with the MBTA Communities Act, the start of construction of a 425-unit multifamily project northwest of the transit hub, and permits issued for a 250-unit multifamily project north of the hub and a mixed-use project just to the west of it.AdvertisementOne of the biggest challenges, though, will be dealing with the property’s contamination and its legacy as a Superfund site (a federal designation that identifies highly polluted properties). Industrial operations at the property, part of what was once known as the Industri-Plex site, contaminated the nearby Aberjona River as well as adjacent wetlands and the Mystic Lakes over the course of more than a century, through the 1960s. The transit agencies, in developing the Anderson center more than 20 years ago, built 25 acres of parking and a subsurface “geotextile” barrier to help contain the underground pollution.For a developer to proceed with residential construction, the transit agencies said, it would need to work with federal and state environmental regulators to reevaluate the residential restriction.The transit hub is named after Jimmy Anderson, a child who died at the age of 12 from leukemia and whose case was made famous in the book and the movie, “A Civil Action,” about groundwater pollution in Woburn.AdvertisementJon Chesto can be reached at jon.chesto@globe.com. Follow him @jonchesto.",
        "Outlet": "Boston Globe",
        "classifications": {
            "Residential Real Estate": 0.6927686333656311,
            "Real Estate Legal": 0.5033596754074097,
            "Real Estate Investment": 0.4794808328151703,
            "Commercial Real Estate": 0.33031848073005676,
            "Real Estate Market Trends": 0.3027951717376709,
            "Real Estate Technology": 0.1974191665649414,
            "Real Estate Finance": 0.17409490048885345
        }
    },
    {
        "url": "https://www.bostonglobe.com/2025/02/28/business/michelle-wu-white-stadium-revolution/",
        "raw_pub_date": "2025-02-28",
        "pub_date": "2025-02-28T00:00:00",
        "hed": "For Mayor Wu, not all sports stadiums are created equal",
        "subhead": "The mayor’s enthusiasm for the White Stadium project stands in sharp contrast to seven years ago, when she blocked a plan for a New England Revolution stadium as a city councilor",
        "content": "It wasn’t that long ago that one of the most powerful members of the Boston City Council raised all sorts of questions about whether the city was moving too quickly to sell city land to a private developer for a professional soccer stadium.The councilor? Michelle Wu, who in 2018 stood in the way of then-Mayor Marty Walsh’s plan to help Robert Kraft build a soccer stadium for his New England Revolution. Walsh wanted to issue a request for proposals, or an RFP, to sell an 18-acre city-owned tow lot in South Boston off the Southeast Expressway, as a way to give Kraft an opportunity at a site for a long-planned Revs stadium.But Walsh had to get his plan past Wu, who at the time chaired a council committee that had to declare the lot surplus property before it could be sold. And she wasn’t going to just greenlight it.“Rather than just take a vote and move on, we should hear more from the public and gather more [information],” Wu told the Globe at the time. “Public land should be used for the greatest public good. We haven’t seen any analysis yet of what the greatest good would be.”AdvertisementMy my, how the tables have turned.The lot never went up for sale — it’s still where you go when your car gets towed from downtown — and Kraft moved on, setting his sights on building a stadium in Everett. But the more things change, the more they stay the same.Wu’s now the mayor, trying to help a new professional women’s soccer team turn White Stadium in Franklin Park into a gleaming new home. And now she, too, is getting in hot water over the city’s RFP process.The White Stadium arrangement is different than the tow lot in that Wu is not selling the 10,000-seat facility to a private developer, but rather leasing it to Boston Unity Soccer Partners for 10 years. Under the deal, the city would continue to own the stadium, and the team would share it with Boston Public Schools. The city and team will split the cost of the renovation, which is expected to exceed $200 million.AdvertisementThe city tow lot south of downtown was once seen as a potential site for a stadium for the New England Revolution. But then-City Councilor Michelle Wu blocked a deal.David L. RyanWhite Stadium has been crumbling for decades, and many a mayor has tried to renovate it. The Wu administration contends that having a private partner is the only way the city can afford to fix it, and the deal struck with the team still gives the community and BPS full-day access to the stadium for all but 40 days of the year.But much as Wu did seven years ago, critics say the White Stadium plan is opaque, misguided, and being rammed through. The city, they say, needs to do more research on how best to renovate the stadium for BPS.This week we learned, as first reported in the Boston Herald, that Wu’s City Hall has been in talks with Boston Unity Soccer Partners about White Stadium as early as September 2022. With the seed planted, the city issued an RFP in April 2023 for a lease of White Stadium in a “public-private partnership.”We can all guess what happened next: The RFP went out, and Boston Unity Soccer Partners was the only group that submitted a proposal.Opponents of the White Stadium plan — some neighbors and the Emerald Necklace Conservancy — have seized on the Herald story, based on email exchanges between the team and city officials, as proof the team had an inside track on the stadium.Mayoral challenger Josh Kraft had choice words, too, calling the report evidence of a “secretive and rigged RFP process.”Wu has vigorously disputed that characterization, calling it “inaccurate.” Indeed, there’s nothing untoward about potential bidders having conversations with the city before an RFP is filed, and it’s conceivable that the RFP generated only a single response.Advertisement(Linda Henry, chief executive of Boston Globe Media Partners, has had a minority interest in the women’s soccer team, and last week she announced she is pulling out of the team’s investor group.)As for what happened in 2018, Wu got on the phone on Thursday to say that she has been “completely consistent” on how there should be public discussions about how to use public land. She said the Walsh administration’s proposal to sell the tow lot for a soccer stadium never went anywhere because no one was willing to publicly offer details at a hearing Wu chaired at the time.“I was never opposed to a soccer stadium in Boston,” she said. “I’ve always felt that we should try to bring that amenity and economic development opportunity and excitement to the city.”Wu went on to say that after becoming mayor she reached out to Robert Kraft about having the Revs stadium in Boston. She said she never heard back. (On Friday, a spokesperson for Robert Kraft said he never heard from the Wu administration.)The White Stadium deal reflects how she feels that public land should not be sold off, similar to how she felt as a councilor in 2018, and how public land as a general principle “should stay wherever possible, under the public trust, under public ownership, because that is how you have permanent control over what happens.”Still, that hasn’t placated opponents who have sued the city to halt the project, with the case set to go to trial on March 18. Demolition is well underway, and Wu said the construction schedule is on track. The women’s team is planning to play in the renovated White Stadium by its inaugural season next spring.AdvertisementMeantime, it’s a mayoral election year. Stadium opponents and supporters are worked up. And just as you thought the L’Affaire White Stadium couldn’t get any messier — it has.So, for Wu, perhaps we’ll file this one under: Do as I say, not as I do.Shirley Leung is a Business columnist. She can be reached at shirley.leung@globe.com.",
        "Outlet": "Boston Globe",
        "classifications": {
            "Real Estate Market Trends": 0.9022800922393799,
            "Real Estate Investment": 0.8695345520973206,
            "Real Estate Legal": 0.8663292527198792,
            "Real Estate Finance": 0.8649378418922424,
            "Residential Real Estate": 0.8573756814002991,
            "Commercial Real Estate": 0.768989086151123,
            "Real Estate Technology": 0.7155845761299133
        }
    }
]